//#124 나라의 숫자
function solution(n) {
    var answer = '';
    var check = 0;
    var arr = ['4', '1', '2'];
    while(n>0){
        check = n % 3; // 나머지 확인
        n = parseInt(n / 3); // 정확한 연산을 위한 parseInt(). 정수형으로 타입과 값을 변환(나머지 버림 연산)
        if(check == 0) n = n - 1; // 나머지가 0이면 몫을 1 줄임.
        answer = arr[check] + answer;
    }
    return answer;
}
/*
 각 자리에 맞는 숫자를 위해 문자열 배열에서 4->1->2 순으로 선언.
이 문제의 맹점은 0이 없다는 것이다. 1 -> 2 -> 4 다음에 다시 11 -> 12 -> 14 순으로 숫자가 증가한다. 3진수로 풀면 될 것 같지만, 실제 3진수로 풀기 위해 3으로 나누어 보면 숫자가 1, 2, 4, 11, 12, 14로 늘어나지만 몫이 0, 0, 1, 1, 1, 2로 나뉘어 실 숫자와 몫이 맞지 않는다. 이 문제를 해결하기 위해서 나머지 값이 0인 경우 -1을 해서 몫을 하나 줄여서 앞의 숫자의 값에 맞도록 보정해야한다.
*/
/*
01 / 3 0 ... 1 // 1
02 / 3 0 ... 2 // 2
03 / 3 1 ... 0 // 4
04 / 3 1 ... 1 // 11
05 / 3 1 ... 2 // 12
06 / 3 2 ... 0 // 14
07 / 3 2 ... 1 // 21
08 / 3 2 ... 2 // 22
09 / 3 3 ... 0 // 24
10 / 3 3 ... 1 // 41
11 / 3 3 ... 2 // 42
12 / 3 4 ... 0 // 44
13 / 3 4 ... 1 // 111
14 / 3 4 ... 2 // 112
15 / 3 5 ... 0 // 114
16 / 3 5 ... 1 // 121
17 / 3 5 ... 2 // 122
18 / 3 6 ... 0 // 124
일반적으로 3진수로 그냥 반복해서 나눌 경우

15 / 3 5 ... 0 / 4
5 / 3 1 ... 2 / 2
1 / 3 0 ... 1 / 1

18 / 3 6...0 // 4
6 / 3 2...0 // 4
2 / 3 0...2 // 2
나머지가 0 이면 12, 15, 18 등에서 실제 124 나라의 숫자와 맞지 않는다. 보정하기 위해서 몫에서 1을 빼주어야하고(만약 3을 나눌 때마다 나머지가 없다면 없을 때마다 해당 몫에서 1을 빼줘야한다. 18의 경우 3으로 나눠서 0이고 나눈 몫인 6을 3으로 나눠도 몫이 0이기 때문에 첫 자리, 두번째 자리에서 3을 빼야 한다.
*/
